{
    "Hall of Beginnings": {
        "description": "Large marble columns tower over you, bearing the weight of a vast stone ceiling. An ornate stone archway covers the north area of the room, containing a shimmering, purple portal. A lady garbed in a white dress stands in front of the portal, barring entry to those she sees fit.",
		"roomitems": {
			"portal": {
				"description": "Attempting to peer around the woman standing in front, you can make out tall buildings, and cobbled pathways.",
				"container": "false"
			}
		},
		"npcs": ["glorifa"],
        "exits": {"east": "Hallway of Knowledge", "west": "Testing Chambers"}
    },
    "Hallway of Knowledge": {
        "description": "The hallway is fairly long and along the walls are stone pedestals, holding large tablets with engraved writing.",
		"roomitems": {
			"help tablet": {
				"description": "The tablet reads: \"HELP\"",
				"container": "false"
			}
		},
		"items": ["silly string"],
		"npcs": ["shamus, the wise"],
        "exits": {"west": "Hall of Beginnings"}
    },
	"Testing Chambers": {
        "description": "This room is much smaller than the hall. Along the walls are racks of basic weapons and armor, fit for all kinds of adventurers. A single chest lies in the middle of the room. A man stands next to the chest waiting for adventurers to approach.",
		"roomitems": {
			"sword rack": {
				"description": "The rack holds seemingly unending amounts of swords. Try TAKE TRAINING SWORD FROM SWORD RACK.",
				"container": "true",				
				"items": ["training sword"]
			},
			"staff rack": {
				"description": "The rack holds seemingly unending amounts of staves. Try TAKE TRAINING STAFF FROM STAFF RACK.",
				"container": "true",
				"items": ["training staff"]
			},
			"bow rack": {
				"description": "The rack holds seemingly unending amounts of bows. Try TAKE TRAINING BOW FROM BOW RACK.",
				"container": "true",
				"items": ["training bow"]
			},
			"plate rack": {
				"description": "The rack holds seemingly unending amounts of platebodies. Try TAKE TRAINING PLATE FROM PLATE RACK.",
				"container": "true",
				"items": ["training plate"]
			},
			"leather rack": {
				"description": "The rack holds seemingly unending amounts of leather bodices. Try TAKE TRAINING BODICE FROM LEATHER RACK.",
				"container": "true",
				"items": ["training bodice"]
			},
			"robe rack": {
				"description": "The rack holds seemingly unending amounts of cloth robes. Try TAKE TRAINING ROBES FROM ROBE RACK.",
				"container": "true",
				"items": ["training robes"]
			},
			"chest": {
				"description": "Upon the chest lies a heavy brass lock. Once you have the key, try UNLOCK CHEST, then OPEN CHEST, then LOOK IN CHEST.",
				"container": "true",
				"open": "false",
				"locked": "yes",
				"items": ["beginner's ticket"]
			}
		},
		"npcs": ["martin, the weaponsmaster"],
		"monsters": ["Scrawny Rat"],
        "exits": {"east": "Hall of Beginnings"}
    }
}